"use client";
import React from "react";

import { PP, PH1, PUl, PLi } from "@app/policy/style";

export const Version250721: React.FC = () => {
  return (
    <>
      <PP>
        안녕하세요 품앗이의 소중한 이용자님, 만나서 반갑습니다!
        <br /> 저희가 준비한 서비스 이용약관을 읽어주시면 감사드리겠습니다.
      </PP>

      <PH1>제1조(목적)</PH1>
      <PP>
        본 약관은 서비스 이용약관에 동의한 사용자(이하 "회원" 또는 "이용자")가
        팀 품앗이(이하 "서비스")에서 제공하는 "품앗이"(이하 "서비스"라 하며,
        추후 서비스 명은 변경될 수 있음)를 이용함에 있어 서비스와 회원간 또는
        회원 간의 권리, 의무 및 책임사항 및 서비스 이용조건 및 절차 등 기본적인
        사항을 규정함을 목적으로 합니다. 서비스 이용약관을 개정하는 경우에는
        홈페이지에 게시하거나 개별적으로 공지할 것입니다.
      </PP>

      <PH1>제2조(제공 서비스)</PH1>
      <PP>제공하는 서비스는 다음과 같습니다.</PP>
      <PUl>
        <PLi>서비스 명 : 품앗이(Poomasi)</PLi>
        <PLi>서비스 내용 : 대학생 전문 상담 멘토링</PLi>
      </PUl>

      <PH1>제3조(계정 관련)</PH1>
      <PP>
        저희 서비스는 카카오 로그인을 이용하여 계정을 생성하실 수 있습니다.
        다만, 아래의 경우에는 계정 생성을 승인하지 않을 수 있습니다.
      </PP>
      <PP>
        (1) 다른 사람의 명의나 휴대전화 번호 등 개인정보를 이용하여 계정을
        생성하려 한 경우
      </PP>
      <PP>(2) 동일인이 다수의 계정을 생성하려 한 경우</PP>
      <PP>
        (3) 계정 생성시 필요한 정보를 입력하지 않거나 허위 정보를 입력한 경우
      </PP>
      <PP>
        (4) 서비스가 과거에 운영원칙 또는 법률 위반 등의 정당한 사유로 해당
        계정을 삭제 또는 징계한 경우
      </PP>

      <PH1>제4조(이용자의 주의사항)</PH1>
      <PP>
        서비스는 사용자가 아래와 같이 잘못된 방법이나 행위로 이용할 경우 사용에
        대한 제재(이용정지, 강제탈퇴 등)를 가할 수 있습니다.
      </PP>
      <PP>
        (1) 잘못된 방법으로 서비스의 제공을 방해하거나 안내하는 방법 이외의 다른
        방법을 사용하여 서비스에 접근하는 행위
      </PP>
      <PP>
        (2) 다른 이용자의 정보를 무단으로 수집, 이용하거나 다른 사람들에게
        제공하는 행위
      </PP>
      <PP>(3) 영리나 홍보 목적으로 이용하는 행위</PP>
      <PP>
        (4) 음란 정보나 저작권 침해 정보 등 공서양속 및 법령에 위반되는 내용의
        정보 등을 발송하거나 게시하는 행위
      </PP>
      <PP>
        (5) 동의 없이 서비스 또는 이에 포함된 소프트웨어의 일부를 복사, 수정,
        배포, 판매, 양도, 대여, 담보제공하거나 타인에게 그 이용을 허락하는 행위
      </PP>
      <PP>
        (6) 소프트웨어를 역설계하거나 소스 코드의 추출을 시도하는 등 서비스를
        복제, 분해 또는 모방하거나 기타 변형하는 행위
      </PP>
      <PP>(7) 관련 법령 또는 서비스의 모든 약관을 준수하지 않는 행위</PP>

      <PH1>제5조(게시물의 관리)</PH1>
      <PP>
        (1) 서비스 사용자가 서비스 내에 게시한 게시물의 저작권은 해당 게시물의
        저작자에게 귀속됩니다.
      </PP>
      <PP>
        (2) 사용자가 서비스 내에 게시하는 게시물은 검색결과 내지 서비스 및 관련
        프로모션, 광고 등에 노출될 수 있으며, 해당 노출을 위해 필요한 범위
        내에서는 일부 수정, 복제, 편집되어 게시될 수 있습니다. 이 경우, 서비스는
        저작권법 규정을 준수하며, 사용자는 언제든지 고객센터 또는 운영자 문의
        기능을 통해 해당 게시물에 대해 삭제, 검색결과 제외, 비공개 등의 조치를
        요청할 수 있습니다.
      </PP>

      <PH1>제6조(권리의 귀속)</PH1>
      <PP>
        (1) 저작권 및 지적재산권은 서비스에 귀속됩니다. 단, 이용자의 게시물 및
        제휴계약에 따라 제공된 저작물 등은 제외합니다.
      </PP>

      <PH1>제7조(책임 제한)</PH1>
      <PP>
        (1) 서비스는 이용자의 질문을 멘토에게 연결하는 플랫폼 서비스만을 제공할
        뿐, 정보를 제공하는 당사자가 아니며, 답변 내용에 대한 정보 및 하자로
        인한 책임은 이용자에게 있습니다.
      </PP>
      <PP>
        (2) 서비스는 질문 및 답변자가 게재한 정보, 자료, 사실의 신뢰도, 정확성
        등 내용에 관해서는 책임을 지지 않습니다.
      </PP>
      <div>
        (3) 서비스는 아래에 기재한 경우로 서비스를 제공할 수 없는 경우 이로 인해
        회원에게 발생한 손해에 대해서는 책임을 부담하지 않습니다.
        <PUl>
          <PLi>천재지변 또는 이에 준하는 불가항력의 상태가 있는 경우</PLi>
          <PLi>
            서비스 제공을 위하여 서비스와 제휴계약을 체결한 제3자의 고의적인
            서비스 방해가 있는 경우
          </PLi>
          <PLi>회원의 귀책사유로 서비스 이용에 장애가 있는 경우</PLi>
          <PLi>
            서비스에 대한 접속 및 서비스의 이용과정에서 발생하는 개인적인 손해
          </PLi>
          <PLi>
            서버에 대한 제3자의 모든 불법적인 접속 또는 서버의 불법적인 이용으로
            부터 발생하는 손해
          </PLi>
          <PLi>
            서버에 대한 전송 또는 서버로 부터의 전송에 대한 제3자의 모든
            불법적인 방해 또는 중단행위로부터 발생하는 손해
          </PLi>
          <PLi>
            제3자가 서비스를 이용하여 불법적으로 전송, 유포하거나, 전송,
            유포되도록 한 모든 바이러스, 스파이웨어 및 기타 악성 프로그램으로
            인한 손해
          </PLi>
          <PLi>전송된 데이터의 오류 생략, 누락 파괴 등으로 발생되는 손해</PLi>
          <PLi>
            회원간의 회원 상태정보 등록 및 서비스 이용 과정에서 발생하는
            명예훼손 기타 불법행위로 인한 각종 민형사상 책임
          </PLi>
          <PLi>기타 서비스의 고의ㆍ과실이 없는 사유로 인한 경우</PLi>
        </PUl>
      </div>

      <PH1>제8조(규정의 준용)</PH1>
      <PP>(1) 본 약관은 대한민국법령에 의하여 규정되고 이행됩니다.</PP>
      <PP>
        (2) 본 약관은 신의성실의 원칙에 따라 공정하게 적용하며, 본 약관에
        명시되지 아니한 사항에 대하여는 관계법령 또는 상관례에 따릅니다.
      </PP>

      <PH1>제9조(시행일)</PH1>
      <PP>이 서비스 이용약관은 2025년 7월 21부터 적용됩니다.</PP>
    </>
  );
};
